Repository: alessandro54/resume
Catalog: xliff/*.xlf
Languages: es

# seb2ece10780bcc6f
source: Full Stack Engineer specialized in Ruby, backed by three years of experience in the technology sector. Augmented by a proficient background in data science, with a focus on employing data-driven methodologies to deliver optimized solutions that streamline the development process by an impressive reduction of 35%, while upholding exceptional code quality and scalability standards.
es: Desarrollador Full Stack especializado en Ruby, avalado por tres años de experiencia en el sector tecnológico. Complementada por, experiencia en la ciencia de datos, con un enfoque en el empleo de metodologías basadas en datos para ofrecer soluciones optimizadas que agilizan el proceso de desarrollo con una impresionante reducción del 35%, manteniendo al mismo tiempo una calidad de código y unos estándares de escalabilidad excepcionales.

# sd9c15bb0dedd6981
source: Ruby on Rails Developer
es: Desarrollador Ruby on Rails

# s062fa9dbff78c2c9
source: Software Consultant
es: Consultor IT

# sed861c987feab31d
source: Mexico City, Mexico (Remote - Freelance)
es: Ciudad de México (Remoto - Freelance)

# sfb974afd422d4412
source: SaaS enabled marketplace of furnished & flexible-lease spaces for Wellness practice.
es: Mercado SaaS de espacios amueblados y de alquiler flexible para la práctica del Bienestar.

# s46ff032f7edb8253
source: Led the initiative to revamp the "Professional Profile", providing users with advanced autonomy in managing shared service information; directly contributing to a remarkable 45% surge in overall client satisfaction.
es: Impulsé la iniciativa de renovar el "Perfil Profesional", proporcionando a los usuarios una autonomía avanzada en la gestión de la información de los servicios compartidos; contribuyendo directamente a un notable aumento del 45% en la satisfacción general de los cliente

# scf9b88fd03718037
source: Ruby Developer
es: Desarrollador Ruby

# se8c7aaad1dcd0015
source: Lima, Peru (Remote - Freelance)
es: Lima, Perú (Remoto - Freelance)

# s84680b624ce5f366
source: Metasearch engine for buying and selling real estate in Peru, Mexico, Ecuador, and Colombia.
es: Motor buscador para comprar y vender bienes raíces en Perú, México, Ecuador y Colombia.

# scb9cce09233733bc
source: Oct 2021 - Jan 2022
es: Oct 21' - Ene 22'

# sdc0c47f3f8da077c
source: Developed and implemented a robust JSON API, exposing 10+ services to customers, resulting in a 40% reduction in response time and enabling seamless integration with third-party applications.
es: Desarrollamos e implementamos una API JSON robusta, exponiendo más de 10 servicios a los clientes, lo que dio lugar a una reducción del 40% en el tiempo de respuesta y permitió una integración perfecta con aplicaciones de terceros.

# s4e2fb2c30e7b95b5
source: Software Engineer
es: Ingeniero de software

# h26cd343136989f27
source: <strong>Universidad Peruana de Ciencias Aplicadas (UPC)</strong> | Software Engineering
es: <strong>Universidad Peruana de Ciencias Aplicadas (UPC)</strong> | Ingeniería de Software

# se97d0a673c84c1be
source: Intensive 6-month full-time coding Bootcamp. The program focuses on strengthening the technical skills as well as Soft Skills like leadership, assertive communication, teamwork, empathy among others.
es: Programa intensivo de 6 meses a tiempo completo. El programa se centra en reforzar las habilidades técnicas, así como Soft Skills como el liderazgo y el trabajo en equipo y la empatía, entre otras.

# s634e15eeda4d3b16
source: Implemented new features following the TDD process to reduce error count by a 70% in production environment.
es: Implementación de nuevas funciones siguiendo el proceso TDD para reducir el recuento de errores en un 70% en entorno de producción

# s634f7d1cce6719b9
source: Designed and executed client-centric solutions, achieving a remarkable 80% reduction in QA refuse rate and elevating client satisfaction within sprints.
es: Diseñó y ejecutó soluciones centradas en el cliente, logrando una notable reducción del 80en la tasa de rechazo de control de calidad y elevando la satisfacción del cliente en los sprints.

# s9e57022a898bcf22
source: Optimized development process through Agile methodology, facilitating daily stand-ups, sprint planning, and retrospectives; utilized feedback to enhance team performance and achieve a 60% increase in development speed.
es: Optimización del proceso de desarrollo a través de la metodología Agile, facilitando reuniones diarias, planificación de sprints y retrospectivas.diarias, planificación de sprints y retrospectivas; se utilizó el feedback para mejorar el equipo y lograr un aumento del 60% en la velocidad de desarrollo.

# sb3925e0c5134e25a
source: Mexico City, Mexico
es: Ciudad de México

# s993485b2d5e6cfa2
source: Remote - Full Time
es: Remoto - Tiempo Completo

# s759f32b4fc64c10a
source: Crowdfunding web application for investing on Mexico real state.
es: Aplicación web de crowdfunding para invertir en inmuebles en México.

# sd162fdcf2bc6f8c9
source: Proposed and led the upgrade migration of the application up to two major releases of Ruby and Rails reducing technical debt by a 50%.
es: Propuso y dirigió la migración de actualización de la aplicación hasta dos versiones principales de Ruby y Rails reduciendo la deuda técnica en un 50%.

# s3b2d051cddc94385
source: Initiated the incorporation of coding best practices, including pair programming, resulting in a 30% acceleration in development speed and a 20% reduction in bug fixing duration.
es: Inició la incorporación de las mejores prácticas de codificación, incluida la programación por parejas, lo que se tradujo en una aceleración del 30% de la velocidad de desarrollo y una reducción del 20% de la duración

# s4fbd72a6c7d19417
source: Digital Platform for distribution of tours and activities in LATAM.
es: Plataforma digital para la distribución de tours y actividades en LATAM.

# s3efb9420c65c1f82
source: Streamlined the refactoring of the legacy code reducing the technical debt by approximately 30% and maintaining scalability of the app.
es: Racionalizamos la refactorización del código heredado reduciendo la deuda técnica en aproximadamente un 30% y manteniendo la escalabilidad de la aplicación.

# seced8ed1ffc8e1d9
source: Revamped Docker integration within the application, driving an impressive 80% improvement in developer experience; streamlined containerization process, reducing deployment time by 50% and minimizing compatibility issues.
es: Integración renovada de Docker en la aplicación, con una mejora impresionante del 80 mejora de la experiencia de los desarrolladores; optimización del proceso de el tiempo de despliegue en un 50% y minimizando los problemas de compatibilidad.

# s28fe3aba33b81566
source: Ruby on Rails Backend Development
es: Desarrollo Backend en Ruby on Rails

# seae1a2bcad75123b
source: Nov 2022 - Aug 2023
es: Nov 22' - Ago 23'

# s55a271f500bbfce4
source: Aug 2015 - Present
es: Aug 15' - Presente

# sb14ae6972efa9695
source: Server Side
es: Servidor

# s367ed489d52e5559
source: Client Side
es: Cliente

# s4d9ddb4396efdbb1
source: Programming Languages
es: Lenguajes

# s46698af6691d1a82
source: Extra tools
es: Herramientas
